'number' + 3 + 3 //рядок 'number33' конкатенація рядків

null + 3 // null перетворюється на 0, потім 0 + 3 = 3

5 && "qwerty" // повернення останнього істинного значення, тому відповідь: qwerty

+'40' + +'2' + "hillel"; // Унарний +, тобто 40 + 2 = 42, 42 + + "hillel" = 42hillel конкатенація

'10' - 5 === 6; // результат false, так як 10-5 =5, а 5 не тотожно дорывнює 6

true + false // true =1, false =0, тому 1+0=1

'4px' - 3 // NaN так як 4px не може бути преведено до числа

'4' - 3 // дорівнюватиме 1. 

'6' + 3 ** 0; // 3 ** 0 = 1, потім '6' + 1 значить далі йде конкатенація строк = '61'

12 / '6' // '6' перетодимо в число, тому 12/6 = 2

'10' + (5 === 6); // 10false, тому що 5 не тотожно 6 = false, далі конкатенація 10 і false

null == '' //false так як null дорівнює лише undefined

3 ** (9 / 3); // 9 / 3 = 3, потім 3 ** 3 = 27

!!'false' == !!'true' // !!'false' і !!'true' перетворюються на true тому результат буде true

0 || '0' && 1 // дорівнює 1, бо '0' && 1, що повертає 1. Потім 0 || 1 повертає 1

(+null == false) < 1; // +null = 0, 0 == false поверне true, true < 1 перепишемо як 1 < 1 і це дасть false

false && true || true // false && true повертає false, потім false || true повертає true

false && (false || true); // false || true повертає true, потім false && true повертає false

(+null == false) < 1 ** 5; /* +null = 0, 0 == false повертає true. Потім 1 ** 5 = 1. 
true < 1 перетворюється на 1 < 1, що повертає false */
